SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/BGM22/Include/bgm22_rac.h
#define _RAC_PATRIM1_TX0DBMTRIMTAPCAP_cap_1p05pF                      0x00000003UL                                             /**< Mode cap_1p05pF for RAC_PATRIM1             */
#define _RAC_PATRIM1_TX0DBMTRIMTAPCAP_cap_1p4pF                       0x00000004UL                                             /**< Mode cap_1p4pF for RAC_PATRIM1              */
#define _RAC_PATRIM1_TX0DBMTRIMTAPCAP_cap_1p75pF                      0x00000005UL                                             /**< Mode cap_1p75pF for RAC_PATRIM1             */
#define _RAC_PATRIM1_TX0DBMTRIMTAPCAP_cap_2p1pF                       0x00000006UL                                             /**< Mode cap_2p1pF for RAC_PATRIM1              */
#define _RAC_PATRIM1_TX0DBMTRIMTAPCAP_cap_2p45pF                      0x00000007UL                                             /**< Mode cap_2p45pF for RAC_PATRIM1             */
#define RAC_PATRIM1_TX0DBMTRIMTAPCAP_DEFAULT                          (_RAC_PATRIM1_TX0DBMTRIMTAPCAP_DEFAULT << 16)            /**< Shifted mode DEFAULT for RAC_PATRIM1        */
#define RAC_PATRIM1_TX0DBMTRIMTAPCAP_cap_0F                           (_RAC_PATRIM1_TX0DBMTRIMTAPCAP_cap_0F << 16)             /**< Shifted mode cap_0F for RAC_PATRIM1         */
#define RAC_PATRIM1_TX0DBMTRIMTAPCAP_cap_0p35pF                       (_RAC_PATRIM1_TX0DBMTRIMTAPCAP_cap_0p35pF << 16)         /**< Shifted mode cap_0p35pF for RAC_PATRIM1     */
#define RAC_PATRIM1_TX0DBMTRIMTAPCAP_cap_0p7pF                        (_RAC_PATRIM1_TX0DBMTRIMTAPCAP_cap_0p7pF << 16)          /**< Shifted mode cap_0p7pF for RAC_PATRIM1      */
#define RAC_PATRIM1_TX0DBMTRIMTAPCAP_cap_1p05pF                       (_RAC_PATRIM1_TX0DBMTRIMTAPCAP_cap_1p05pF << 16)         /**< Shifted mode cap_1p05pF for RAC_PATRIM1     */
#define RAC_PATRIM1_TX0DBMTRIMTAPCAP_cap_1p4pF                        (_RAC_PATRIM1_TX0DBMTRIMTAPCAP_cap_1p4pF << 16)          /**< Shifted mode cap_1p4pF for RAC_PATRIM1      */
#define RAC_PATRIM1_TX0DBMTRIMTAPCAP_cap_1p75pF                       (_RAC_PATRIM1_TX0DBMTRIMTAPCAP_cap_1p75pF << 16)         /**< Shifted mode cap_1p75pF for RAC_PATRIM1     */
#define RAC_PATRIM1_TX0DBMTRIMTAPCAP_cap_2p1pF                        (_RAC_PATRIM1_TX0DBMTRIMTAPCAP_cap_2p1pF << 16)          /**< Shifted mode cap_2p1pF for RAC_PATRIM1      */
#define RAC_PATRIM1_TX0DBMTRIMTAPCAP_cap_2p45pF                       (_RAC_PATRIM1_TX0DBMTRIMTAPCAP_cap_2p45pF << 16)         /**< Shifted mode cap_2p45pF for RAC_PATRIM1     */

/* Bit fields for RAC PATRIM2 */
#define _RAC_PATRIM2_RESETVALUE                                       0x00000088UL                                             /**< Default value for RAC_PATRIM2               */
#define _RAC_PATRIM2_MASK                                             0x00003FFFUL                                             /**< Mask for RAC_PATRIM2                        */
#define _RAC_PATRIM2_TX6DBMTRIMBIASN_SHIFT                            0                                                        /**< Shift value for RAC_TX6DBMTRIMBIASN         */
#define _RAC_PATRIM2_TX6DBMTRIMBIASN_MASK                             0xFUL                                                    /**< Bit mask for RAC_TX6DBMTRIMBIASN            */
#define _RAC_PATRIM2_TX6DBMTRIMBIASN_DEFAULT                          0x00000008UL                                             /**< Mode DEFAULT for RAC_PATRIM2                */
#define _RAC_PATRIM2_TX6DBMTRIMBIASN_vnbias_dn104mV                   0x00000000UL                                             /**< Mode vnbias_dn104mV for RAC_PATRIM2         */
#define _RAC_PATRIM2_TX6DBMTRIMBIASN_vnbias_dn91mV                    0x00000001UL                                             /**< Mode vnbias_dn91mV for RAC_PATRIM2          */
#define _RAC_PATRIM2_TX6DBMTRIMBIASN_vnbias_dn78mV                    0x00000002UL                                             /**< Mode vnbias_dn78mV for RAC_PATRIM2          */
#define _RAC_PATRIM2_TX6DBMTRIMBIASN_vnbias_dn65mV                    0x00000003UL                                             /**< Mode vnbias_dn65mV for RAC_PATRIM2          */
#define _RAC_PATRIM2_TX6DBMTRIMBIASN_vnbias_dn52mV                    0x00000004UL                                             /**< Mode vnbias_dn52mV for RAC_PATRIM2          */
#define _RAC_PATRIM2_TX6DBMTRIMBIASN_vnbias_dn39mV                    0x00000005UL                                             /**< Mode vnbias_dn39mV for RAC_PATRIM2          */
#define _RAC_PATRIM2_TX6DBMTRIMBIASN_vnbias_dn26mV                    0x00000006UL                                             /**< Mode vnbias_dn26mV for RAC_PATRIM2          */
#define _RAC_PATRIM2_TX6DBMTRIMBIASN_vnbias_dn13mV                    0x00000007UL                                             /**< Mode vnbias_dn13mV for RAC_PATRIM2          */
#define _RAC_PATRIM2_TX6DBMTRIMBIASN_vnbias_default_613mV             0x00000008UL                                             /**< Mode vnbias_default_613mV for RAC_PATRIM2   */
#define _RAC_PATRIM2_TX6DBMTRIMBIASN_vnbias_up13mV                    0x00000009UL                                             /**< Mode vnbias_up13mV for RAC_PATRIM2          */
#define _RAC_PATRIM2_TX6DBMTRIMBIASN_vnbias_up26mV                    0x0000000AUL                                             /**< Mode vnbias_up26mV for RAC_PATRIM2          */
#define _RAC_PATRIM2_TX6DBMTRIMBIASN_vnbias_up39mV                    0x0000000BUL                                             /**< Mode vnbias_up39mV for RAC_PATRIM2          */
#define _RAC_PATRIM2_TX6DBMTRIMBIASN_vnbias_up52mV                    0x0000000CUL                                             /**< Mode vnbias_up52mV for RAC_PATRIM2          */
#define _RAC_PATRIM2_TX6DBMTRIMBIASN_vnbias_up65mV                    0x0000000DUL                                             /**< Mode vnbias_up65mV for RAC_PATRIM2          */
#define _RAC_PATRIM2_TX6DBMTRIMBIASN_vnbias_up78mV                    0x0000000EUL                                             /**< Mode vnbias_up78mV for RAC_PATRIM2          */
#define _RAC_PATRIM2_TX6DBMTRIMBIASN_vnbias_up91mV                    0x0000000FUL                                             /**< Mode vnbias_up91mV for RAC_PATRIM2          */
#define RAC_PATRIM2_TX6DBMTRIMBIASN_DEFAULT                           (_RAC_PATRIM2_TX6DBMTRIMBIASN_DEFAULT << 0)              /**< Shifted mode DEFAULT for RAC_PATRIM2        */
#define RAC_PATRIM2_TX6DBMTRIMBIASN_vnbias_dn104mV                    (_RAC_PATRIM2_TX6DBMTRIMBIASN_vnbias_dn104mV << 0)       /**< Shifted mode vnbias_dn104mV for RAC_PATRIM2 */
#define RAC_PATRIM2_TX6DBMTRIMBIASN_vnbias_dn91mV                     (_RAC_PATRIM2_TX6DBMTRIMBIASN_vnbias_dn91mV << 0)        /**< Shifted mode vnbias_dn91mV for RAC_PATRIM2  */
#define RAC_PATRIM2_TX6DBMTRIMBIASN_vnbias_dn78mV                     (_RAC_PATRIM2_TX6DBMTRIMBIASN_vnbias_dn78mV << 0)        /**< Shifted mode vnbias_dn78mV for RAC_PATRIM2  */
#define RAC_PATRIM2_TX6DBMTRIMBIASN_vnbias_dn65mV                     (_RAC_PATRIM2_TX6DBMTRIMBIASN_vnbias_dn65mV << 0)        /**< Shifted mode vnbias_dn65mV for RAC_PATRIM2  */
#define RAC_PATRIM2_TX6DBMTRIMBIASN_vnbias_dn52mV                     (_RAC_PATRIM2_TX6DBMTRIMBIASN_vnbias_dn52mV << 0)        /**< Shifted mode vnbias_dn52mV for RAC_PATRIM2  */
#define RAC_PATRIM2_TX6DBMTRIMBIASN_vnbias_dn39mV                     (_RAC_PATRIM2_TX6DBMTRIMBIASN_vnbias_dn39mV << 0)        /**< Shifted mode vnbias_dn39mV for RAC_PATRIM2  */
#define RAC_PATRIM2_TX6DBMTRIMBIASN_vnbias_dn26mV                     (_RAC_PATRIM2_TX6DBMTRIMBIASN_vnbias_dn26mV << 0)        /**< Shifted mode vnbias_dn26mV for RAC_PATRIM2  */
#define RAC_PATRIM2_TX6DBMTRIMBIASN_vnbias_dn13mV                     (_RAC_PATRIM2_TX6DBMTRIMBIASN_vnbias_dn13mV << 0)        /**< Shifted mode vnbias_dn13mV for RAC_PATRIM2  */
#define RAC_PATRIM2_TX6DBMTRIMBIASN_vnbias_default_613mV              (_RAC_PATRIM2_TX6DBMTRIMBIASN_vnbias_default_613mV << 0) /**< Shifted mode vnbias_default_613mV for RAC_PATRIM2*/
#define RAC_PATRIM2_TX6DBMTRIMBIASN_vnbias_up13mV                     (_RAC_PATRIM2_TX6DBMTRIMBIASN_vnbias_up13mV << 0)        /**< Shifted mode vnbias_up13mV for RAC_PATRIM2  */
#define RAC_PATRIM2_TX6DBMTRIMBIASN_vnbias_up26mV                     (_RAC_PATRIM2_TX6DBMTRIMBIASN_vnbias_up26mV << 0)        /**< Shifted mode vnbias_up26mV for RAC_PATRIM2  */
#define RAC_PATRIM2_TX6DBMTRIMBIASN_vnbias_up39mV                     (_RAC_PATRIM2_TX6DBMTRIMBIASN_vnbias_up39mV << 0)        /**< Shifted mode vnbias_up39mV for RAC_PATRIM2  */
#define RAC_PATRIM2_TX6DBMTRIMBIASN_vnbias_up52mV                     (_RAC_PATRIM2_TX6DBMTRIMBIASN_vnbias_up52mV << 0)        /**< Shifted mode vnbias_up52mV for RAC_PATRIM2  */
#define RAC_PATRIM2_TX6DBMTRIMBIASN_vnbias_up65mV                     (_RAC_PATRIM2_TX6DBMTRIMBIASN_vnbias_up65mV << 0)        /**< Shifted mode vnbias_up65mV for RAC_PATRIM2  */
#define RAC_PATRIM2_TX6DBMTRIMBIASN_vnbias_up78mV                     (_RAC_PATRIM2_TX6DBMTRIMBIASN_vnbias_up78mV << 0)        /**< Shifted mode vnbias_up78mV for RAC_PATRIM2  */
#define RAC_PATRIM2_TX6DBMTRIMBIASN_vnbias_up91mV                     (_RAC_PATRIM2_TX6DBMTRIMBIASN_vnbias_up91mV << 0)        /**< Shifted mode vnbias_up91mV for RAC_PATRIM2  */
#define _RAC_PATRIM2_TX6DBMTRIMBIASP_SHIFT                            4                                                        /**< Shift value for RAC_TX6DBMTRIMBIASP         */
#define _RAC_PATRIM2_TX6DBMTRIMBIASP_MASK                             0xF0UL                                                   /**< Bit mask for RAC_TX6DBMTRIMBIASP            */
#define _RAC_PATRIM2_TX6DBMTRIMBIASP_DEFAULT                          0x00000008UL                                             /**< Mode DEFAULT for RAC_PATRIM2                */
#define _RAC_PATRIM2_TX6DBMTRIMBIASP_vpbias_dn104mV                   0x00000000UL                                             /**< Mode vpbias_dn104mV for RAC_PATRIM2         */
#define _RAC_PATRIM2_TX6DBMTRIMBIASP_vpbias_dn91mV                    0x00000001UL                                             /**< Mode vpbias_dn91mV for RAC_PATRIM2          */
#define _RAC_PATRIM2_TX6DBMTRIMBIASP_vpbias_dn78mV                    0x00000002UL                                             /**< Mode vpbias_dn78mV for RAC_PATRIM2          */
#define _RAC_PATRIM2_TX6DBMTRIMBIASP_vpbias_dn65mV                    0x00000003UL                                             /**< Mode vpbias_dn65mV for RAC_PATRIM2          */
#define _RAC_PATRIM2_TX6DBMTRIMBIASP_vpbias_dn52mV                    0x00000004UL                                             /**< Mode vpbias_dn52mV for RAC_PATRIM2          */
#define _RAC_PATRIM2_TX6DBMTRIMBIASP_vpbias_dn39mV                    0x00000005UL                                             /**< Mode vpbias_dn39mV for RAC_PATRIM2          */
#define _RAC_PATRIM2_TX6DBMTRIMBIASP_vpbias_dn26mV                    0x00000006UL                                             /**< Mode vpbias_dn26mV for RAC_PATRIM2          */
#define _RAC_PATRIM2_TX6DBMTRIMBIASP_vpbias_dn13mV                    0x00000007UL                                             /**< Mode vpbias_dn13mV for RAC_PATRIM2          */
#define _RAC_PATRIM2_TX6DBMTRIMBIASP_vpbias_default_949mV             0x00000008UL                                             /**< Mode vpbias_default_949mV for RAC_PATRIM2   */
#define _RAC_PATRIM2_TX6DBMTRIMBIASP_vpbias_up13mV                    0x00000009UL                                             /**< Mode vpbias_up13mV for RAC_PATRIM2          */
#define _RAC_PATRIM2_TX6DBMTRIMBIASP_vpbias_up26mV                    0x0000000AUL                                             /**< Mode vpbias_up26mV for RAC_PATRIM2          */
#define _RAC_PATRIM2_TX6DBMTRIMBIASP_vpbias_up39mV                    0x0000000BUL                                             /**< Mode vpbias_up39mV for RAC_PATRIM2          */
#define _RAC_PATRIM2_TX6DBMTRIMBIASP_vpbias_up52mV                    0x0000000CUL                                             /**< Mode vpbias_up52mV for RAC_PATRIM2          */
#define _RAC_PATRIM2_TX6DBMTRIMBIASP_vpbias_up65mV                    0x0000000DUL                                             /**< Mode vpbias_up65mV for RAC_PATRIM2          */
#define _RAC_PATRIM2_TX6DBMTRIMBIASP_vpbias_up78mV                    0x0000000EUL                                             /**< Mode vpbias_up78mV for RAC_PATRIM2          */
#define _RAC_PATRIM2_TX6DBMTRIMBIASP_vpbias_up91mV                    0x0000000FUL                                             /**< Mode vpbias_up91mV for RAC_PATRIM2          */
#define RAC_PATRIM2_TX6DBMTRIMBIASP_DEFAULT                           (_RAC_PATRIM2_TX6DBMTRIMBIASP_DEFAULT << 4)              /**< Shifted mode DEFAULT for RAC_PATRIM2        */
#define RAC_PATRIM2_TX6DBMTRIMBIASP_vpbias_dn104mV                    (_RAC_PATRIM2_TX6DBMTRIMBIASP_vpbias_dn104mV << 4)       /**< Shifted mode vpbias_dn104mV for RAC_PATRIM2 */
#define RAC_PATRIM2_TX6DBMTRIMBIASP_vpbias_dn91mV                     (_RAC_PATRIM2_TX6DBMTRIMBIASP_vpbias_dn91mV << 4)        /**< Shifted mode vpbias_dn91mV for RAC_PATRIM2  */
#define RAC_PATRIM2_TX6DBMTRIMBIASP_vpbias_dn78mV                     (_RAC_PATRIM2_TX6DBMTRIMBIASP_vpbias_dn78mV << 4)        /**< Shifted mode vpbias_dn78mV for RAC_PATRIM2  */
#define RAC_PATRIM2_TX6DBMTRIMBIASP_vpbias_dn65mV                     (_RAC_PATRIM2_TX6DBMTRIMBIASP_vpbias_dn65mV << 4)        /**< Shifted mode vpbias_dn65mV for RAC_PATRIM2  */
#define RAC_PATRIM2_TX6DBMTRIMBIASP_vpbias_dn52mV                     (_RAC_PATRIM2_TX6DBMTRIMBIASP_vpbias_dn52mV << 4)        /**< Shifted mode vpbias_dn52mV for RAC_PATRIM2  */
#define RAC_PATRIM2_TX6DBMTRIMBIASP_vpbias_dn39mV                     (_RAC_PATRIM2_TX6DBMTRIMBIASP_vpbias_dn39mV << 4)        /**< Shifted mode vpbias_dn39mV for RAC_PATRIM2  */
#define RAC_PATRIM2_TX6DBMTRIMBIASP_vpbias_dn26mV                     (_RAC_PATRIM2_TX6DBMTRIMBIASP_vpbias_dn26mV << 4)        /**< Shifted mode vpbias_dn26mV for RAC_PATRIM2  */
#define RAC_PATRIM2_TX6DBMTRIMBIASP_vpbias_dn13mV                     (_RAC_PATRIM2_TX6DBMTRIMBIASP_vpbias_dn13mV << 4)        /**< Shifted mode vpbias_dn13mV for RAC_PATRIM2  */
#define RAC_PATRIM2_TX6DBMTRIMBIASP_vpbias_default_949mV              (_RAC_PATRIM2_TX6DBMTRIMBIASP_vpbias_default_949mV << 4) /**< Shifted mode vpbias_default_949mV for RAC_PATRIM2*/
#define RAC_PATRIM2_TX6DBMTRIMBIASP_vpbias_up13mV                     (_RAC_PATRIM2_TX6DBMTRIMBIASP_vpbias_up13mV << 4)        /**< Shifted mode vpbias_up13mV for RAC_PATRIM2  */
#define RAC_PATRIM2_TX6DBMTRIMBIASP_vpbias_up26mV                     (_RAC_PATRIM2_TX6DBMTRIMBIASP_vpbias_up26mV << 4)        /**< Shifted mode vpbias_up26mV for RAC_PATRIM2  */
#define RAC_PATRIM2_TX6DBMTRIMBIASP_vpbias_up39mV                     (_RAC_PATRIM2_TX6DBMTRIMBIASP_vpbias_up39mV << 4)        /**< Shifted mode vpbias_up39mV for RAC_PATRIM2  */
#define RAC_PATRIM2_TX6DBMTRIMBIASP_vpbias_up52mV                     (_RAC_PATRIM2_TX6DBMTRIMBIASP_vpbias_up52mV << 4)        /**< Shifted mode vpbias_up52mV for RAC_PATRIM2  */
#define RAC_PATRIM2_TX6DBMTRIMBIASP_vpbias_up65mV                     (_RAC_PATRIM2_TX6DBMTRIMBIASP_vpbias_up65mV << 4)        /**< Shifted mode vpbias_up65mV for RAC_PATRIM2  */
#define RAC_PATRIM2_TX6DBMTRIMBIASP_vpbias_up78mV                     (_RAC_PATRIM2_TX6DBMTRIMBIASP_vpbias_up78mV << 4)        /**< Shifted mode vpbias_up78mV for RAC_PATRIM2  */
#define RAC_PATRIM2_TX6DBMTRIMBIASP_vpbias_up91mV                     (_RAC_PATRIM2_TX6DBMTRIMBIASP_vpbias_up91mV << 4)        /**< Shifted mode vpbias_up91mV for RAC_PATRIM2  */
#define _RAC_PATRIM2_TX6DBMTRIMDUTYCYN_SHIFT                          8                                                        /**< Shift value for RAC_TX6DBMTRIMDUTYCYN       */
#define _RAC_PATRIM2_TX6DBMTRIMDUTYCYN_MASK                           0x700UL                                                  /**< Bit mask for RAC_TX6DBMTRIMDUTYCYN          */
#define _RAC_PATRIM2_TX6DBMTRIMDUTYCYN_DEFAULT                        0x00000000UL                                             /**< Mode DEFAULT for RAC_PATRIM2                */
#define _RAC_PATRIM2_TX6DBMTRIMDUTYCYN_up_0pct                        0x00000000UL                                             /**< Mode up_0pct for RAC_PATRIM2                */
#define _RAC_PATRIM2_TX6DBMTRIMDUTYCYN_up_1pct                        0x00000001UL                                             /**< Mode up_1pct for RAC_PATRIM2                */
#define _RAC_PATRIM2_TX6DBMTRIMDUTYCYN_up_2pct                        0x00000002UL                                             /**< Mode up_2pct for RAC_PATRIM2                */
#define _RAC_PATRIM2_TX6DBMTRIMDUTYCYN_up_3pct                        0x00000003UL                                             /**< Mode up_3pct for RAC_PATRIM2                */
#define _RAC_PATRIM2_TX6DBMTRIMDUTYCYN_up_4pct                        0x00000004UL                                             /**< Mode up_4pct for RAC_PATRIM2                */
#define _RAC_PATRIM2_TX6DBMTRIMDUTYCYN_up_5pct                        0x00000005UL                                             /**< Mode up_5pct for RAC_PATRIM2                */
#define _RAC_PATRIM2_TX6DBMTRIMDUTYCYN_up_6pct                        0x00000006UL                                             /**< Mode up_6pct for RAC_PATRIM2                */
#define _RAC_PATRIM2_TX6DBMTRIMDUTYCYN_na                             0x00000007UL                                             /**< Mode na for RAC_PATRIM2                     */
#define RAC_PATRIM2_TX6DBMTRIMDUTYCYN_DEFAULT                         (_RAC_PATRIM2_TX6DBMTRIMDUTYCYN_DEFAULT << 8)            /**< Shifted mode DEFAULT for RAC_PATRIM2        */
#define RAC_PATRIM2_TX6DBMTRIMDUTYCYN_up_0pct                         (_RAC_PATRIM2_TX6DBMTRIMDUTYCYN_up_0pct << 8)            /**< Shifted mode up_0pct for RAC_PATRIM2        */
#define RAC_PATRIM2_TX6DBMTRIMDUTYCYN_up_1pct                         (_RAC_PATRIM2_TX6DBMTRIMDUTYCYN_up_1pct << 8)            /**< Shifted mode up_1pct for RAC_PATRIM2        */
#define RAC_PATRIM2_TX6DBMTRIMDUTYCYN_up_2pct                         (_RAC_PATRIM2_TX6DBMTRIMDUTYCYN_up_2pct << 8)            /**< Shifted mode up_2pct for RAC_PATRIM2        */
#define RAC_PATRIM2_TX6DBMTRIMDUTYCYN_up_3pct                         (_RAC_PATRIM2_TX6DBMTRIMDUTYCYN_up_3pct << 8)            /**< Shifted mode up_3pct for RAC_PATRIM2        */
#define RAC_PATRIM2_TX6DBMTRIMDUTYCYN_up_4pct                         (_RAC_PATRIM2_TX6DBMTRIMDUTYCYN_up_4pct << 8)            /**< Shifted mode up_4pct for RAC_PATRIM2        */
#define RAC_PATRIM2_TX6DBMTRIMDUTYCYN_up_5pct                         (_RAC_PATRIM2_TX6DBMTRIMDUTYCYN_up_5pct << 8)            /**< Shifted mode up_5pct for RAC_PATRIM2        */
#define RAC_PATRIM2_TX6DBMTRIMDUTYCYN_up_6pct                         (_RAC_PATRIM2_TX6DBMTRIMDUTYCYN_up_6pct << 8)            /**< Shifted mode up_6pct for RAC_PATRIM2        */
#define RAC_PATRIM2_TX6DBMTRIMDUTYCYN_na                              (_RAC_PATRIM2_TX6DBMTRIMDUTYCYN_na << 8)                 /**< Shifted mode na for RAC_PATRIM2             */
#define _RAC_PATRIM2_TX6DBMTRIMDUTYCYP_SHIFT                          11                                                       /**< Shift value for RAC_TX6DBMTRIMDUTYCYP       */
#define _RAC_PATRIM2_TX6DBMTRIMDUTYCYP_MASK                           0x3800UL                                                 /**< Bit mask for RAC_TX6DBMTRIMDUTYCYP          */
#define _RAC_PATRIM2_TX6DBMTRIMDUTYCYP_DEFAULT                        0x00000000UL                                             /**< Mode DEFAULT for RAC_PATRIM2                */
#define _RAC_PATRIM2_TX6DBMTRIMDUTYCYP_dn_0pct                        0x00000000UL                                             /**< Mode dn_0pct for RAC_PATRIM2                */
#define _RAC_PATRIM2_TX6DBMTRIMDUTYCYP_dn_1pct                        0x00000001UL                                             /**< Mode dn_1pct for RAC_PATRIM2                */
#define _RAC_PATRIM2_TX6DBMTRIMDUTYCYP_dn_2pct                        0x00000002UL                                             /**< Mode dn_2pct for RAC_PATRIM2                */
#define _RAC_PATRIM2_TX6DBMTRIMDUTYCYP_dn_3pct                        0x00000003UL                                             /**< Mode dn_3pct for RAC_PATRIM2                */
#define _RAC_PATRIM2_TX6DBMTRIMDUTYCYP_dn_4pct                        0x00000004UL                                             /**< Mode dn_4pct for RAC_PATRIM2                */
#define _RAC_PATRIM2_TX6DBMTRIMDUTYCYP_dn_5pct                        0x00000005UL                                             /**< Mode dn_5pct for RAC_PATRIM2                */
#define _RAC_PATRIM2_TX6DBMTRIMDUTYCYP_dn_6pct                        0x00000006UL                                             /**< Mode dn_6pct for RAC_PATRIM2                */
#define _RAC_PATRIM2_TX6DBMTRIMDUTYCYP_na                             0x00000007UL                                             /**< Mode na for RAC_PATRIM2                     */
#define RAC_PATRIM2_TX6DBMTRIMDUTYCYP_DEFAULT                         (_RAC_PATRIM2_TX6DBMTRIMDUTYCYP_DEFAULT << 11)           /**< Shifted mode DEFAULT for RAC_PATRIM2        */
#define RAC_PATRIM2_TX6DBMTRIMDUTYCYP_dn_0pct                         (_RAC_PATRIM2_TX6DBMTRIMDUTYCYP_dn_0pct << 11)           /**< Shifted mode dn_0pct for RAC_PATRIM2        */
#define RAC_PATRIM2_TX6DBMTRIMDUTYCYP_dn_1pct                         (_RAC_PATRIM2_TX6DBMTRIMDUTYCYP_dn_1pct << 11)           /**< Shifted mode dn_1pct for RAC_PATRIM2        */
#define RAC_PATRIM2_TX6DBMTRIMDUTYCYP_dn_2pct                         (_RAC_PATRIM2_TX6DBMTRIMDUTYCYP_dn_2pct << 11)           /**< Shifted mode dn_2pct for RAC_PATRIM2        */
#define RAC_PATRIM2_TX6DBMTRIMDUTYCYP_dn_3pct                         (_RAC_PATRIM2_TX6DBMTRIMDUTYCYP_dn_3pct << 11)           /**< Shifted mode dn_3pct for RAC_PATRIM2        */
#define RAC_PATRIM2_TX6DBMTRIMDUTYCYP_dn_4pct                         (_RAC_PATRIM2_TX6DBMTRIMDUTYCYP_dn_4pct << 11)           /**< Shifted mode dn_4pct for RAC_PATRIM2        */
#define RAC_PATRIM2_TX6DBMTRIMDUTYCYP_dn_5pct                         (_RAC_PATRIM2_TX6DBMTRIMDUTYCYP_dn_5pct << 11)           /**< Shifted mode dn_5pct for RAC_PATRIM2        */
#define RAC_PATRIM2_TX6DBMTRIMDUTYCYP_dn_6pct                         (_RAC_PATRIM2_TX6DBMTRIMDUTYCYP_dn_6pct << 11)           /**< Shifted mode dn_6pct for RAC_PATRIM2        */
#define RAC_PATRIM2_TX6DBMTRIMDUTYCYP_na                              (_RAC_PATRIM2_TX6DBMTRIMDUTYCYP_na << 11)                /**< Shifted mode na for RAC_PATRIM2             */

