SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/BGM22/Include/bgm22_rac.h
/* Bit fields for RAC RFPATHEN */
#define _RAC_RFPATHEN_RESETVALUE                                      0x00000004UL                                     /**< Default value for RAC_RFPATHEN              */
#define _RAC_RFPATHEN_MASK                                            0x0000001EUL                                     /**< Mask for RAC_RFPATHEN                       */
#define RAC_RFPATHEN_LNAMIXEN                                         (0x1UL << 1)                                     /**< LNAMIXEN                                    */
#define _RAC_RFPATHEN_LNAMIXEN_SHIFT                                  1                                                /**< Shift value for RAC_LNAMIXEN                */
#define _RAC_RFPATHEN_LNAMIXEN_MASK                                   0x2UL                                            /**< Bit mask for RAC_LNAMIXEN                   */
#define _RAC_RFPATHEN_LNAMIXEN_DEFAULT                                0x00000000UL                                     /**< Mode DEFAULT for RAC_RFPATHEN               */
#define _RAC_RFPATHEN_LNAMIXEN_disable                                0x00000000UL                                     /**< Mode disable for RAC_RFPATHEN               */
#define _RAC_RFPATHEN_LNAMIXEN_enable                                 0x00000001UL                                     /**< Mode enable for RAC_RFPATHEN                */
#define RAC_RFPATHEN_LNAMIXEN_DEFAULT                                 (_RAC_RFPATHEN_LNAMIXEN_DEFAULT << 1)            /**< Shifted mode DEFAULT for RAC_RFPATHEN       */
#define RAC_RFPATHEN_LNAMIXEN_disable                                 (_RAC_RFPATHEN_LNAMIXEN_disable << 1)            /**< Shifted mode disable for RAC_RFPATHEN       */
#define RAC_RFPATHEN_LNAMIXEN_enable                                  (_RAC_RFPATHEN_LNAMIXEN_enable << 1)             /**< Shifted mode enable for RAC_RFPATHEN        */
#define RAC_RFPATHEN_LNAMIXRFATTDCEN                                  (0x1UL << 2)                                     /**< LNAMIXRFATTDCEN                             */
#define _RAC_RFPATHEN_LNAMIXRFATTDCEN_SHIFT                           2                                                /**< Shift value for RAC_LNAMIXRFATTDCEN         */
#define _RAC_RFPATHEN_LNAMIXRFATTDCEN_MASK                            0x4UL                                            /**< Bit mask for RAC_LNAMIXRFATTDCEN            */
#define _RAC_RFPATHEN_LNAMIXRFATTDCEN_DEFAULT                         0x00000001UL                                     /**< Mode DEFAULT for RAC_RFPATHEN               */
#define _RAC_RFPATHEN_LNAMIXRFATTDCEN_disable_dc                      0x00000000UL                                     /**< Mode disable_dc for RAC_RFPATHEN            */
#define _RAC_RFPATHEN_LNAMIXRFATTDCEN_enable_dc                       0x00000001UL                                     /**< Mode enable_dc for RAC_RFPATHEN             */
#define RAC_RFPATHEN_LNAMIXRFATTDCEN_DEFAULT                          (_RAC_RFPATHEN_LNAMIXRFATTDCEN_DEFAULT << 2)     /**< Shifted mode DEFAULT for RAC_RFPATHEN       */
#define RAC_RFPATHEN_LNAMIXRFATTDCEN_disable_dc                       (_RAC_RFPATHEN_LNAMIXRFATTDCEN_disable_dc << 2)  /**< Shifted mode disable_dc for RAC_RFPATHEN    */
#define RAC_RFPATHEN_LNAMIXRFATTDCEN_enable_dc                        (_RAC_RFPATHEN_LNAMIXRFATTDCEN_enable_dc << 2)   /**< Shifted mode enable_dc for RAC_RFPATHEN     */
#define RAC_RFPATHEN_LNAMIXRFPKDENRF                                  (0x1UL << 3)                                     /**< LNAMIXRFPKDENRF                             */
#define _RAC_RFPATHEN_LNAMIXRFPKDENRF_SHIFT                           3                                                /**< Shift value for RAC_LNAMIXRFPKDENRF         */
#define _RAC_RFPATHEN_LNAMIXRFPKDENRF_MASK                            0x8UL                                            /**< Bit mask for RAC_LNAMIXRFPKDENRF            */
#define _RAC_RFPATHEN_LNAMIXRFPKDENRF_DEFAULT                         0x00000000UL                                     /**< Mode DEFAULT for RAC_RFPATHEN               */
#define _RAC_RFPATHEN_LNAMIXRFPKDENRF_disable                         0x00000000UL                                     /**< Mode disable for RAC_RFPATHEN               */
#define _RAC_RFPATHEN_LNAMIXRFPKDENRF_enable_path                     0x00000001UL                                     /**< Mode enable_path for RAC_RFPATHEN           */
#define RAC_RFPATHEN_LNAMIXRFPKDENRF_DEFAULT                          (_RAC_RFPATHEN_LNAMIXRFPKDENRF_DEFAULT << 3)     /**< Shifted mode DEFAULT for RAC_RFPATHEN       */
#define RAC_RFPATHEN_LNAMIXRFPKDENRF_disable                          (_RAC_RFPATHEN_LNAMIXRFPKDENRF_disable << 3)     /**< Shifted mode disable for RAC_RFPATHEN       */
#define RAC_RFPATHEN_LNAMIXRFPKDENRF_enable_path                      (_RAC_RFPATHEN_LNAMIXRFPKDENRF_enable_path << 3) /**< Shifted mode enable_path for RAC_RFPATHEN   */
#define RAC_RFPATHEN_LNAMIXTRSW                                       (0x1UL << 4)                                     /**< LNAMIXTRSW                                  */
#define _RAC_RFPATHEN_LNAMIXTRSW_SHIFT                                4                                                /**< Shift value for RAC_LNAMIXTRSW              */
#define _RAC_RFPATHEN_LNAMIXTRSW_MASK                                 0x10UL                                           /**< Bit mask for RAC_LNAMIXTRSW                 */
#define _RAC_RFPATHEN_LNAMIXTRSW_DEFAULT                              0x00000000UL                                     /**< Mode DEFAULT for RAC_RFPATHEN               */
#define _RAC_RFPATHEN_LNAMIXTRSW_disabled                             0x00000000UL                                     /**< Mode disabled for RAC_RFPATHEN              */
#define _RAC_RFPATHEN_LNAMIXTRSW_enabled                              0x00000001UL                                     /**< Mode enabled for RAC_RFPATHEN               */
#define RAC_RFPATHEN_LNAMIXTRSW_DEFAULT                               (_RAC_RFPATHEN_LNAMIXTRSW_DEFAULT << 4)          /**< Shifted mode DEFAULT for RAC_RFPATHEN       */
#define RAC_RFPATHEN_LNAMIXTRSW_disabled                              (_RAC_RFPATHEN_LNAMIXTRSW_disabled << 4)         /**< Shifted mode disabled for RAC_RFPATHEN      */
#define RAC_RFPATHEN_LNAMIXTRSW_enabled                               (_RAC_RFPATHEN_LNAMIXTRSW_enabled << 4)          /**< Shifted mode enabled for RAC_RFPATHEN       */

