SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/BGM22/Include/bgm22_rac.h
/* Bit fields for RAC SYLOEN */
#define _RAC_SYLOEN_RESETVALUE                                        0x00000000UL                                      /**< Default value for RAC_SYLOEN                */
#define _RAC_SYLOEN_MASK                                              0x80000663UL                                      /**< Mask for RAC_SYLOEN                         */
#define RAC_SYLOEN_SYLODIVRLOADCCLK2G4EN                              (0x1UL << 0)                                      /**< SYLODIVRLOADCCLK2G4EN                       */
#define _RAC_SYLOEN_SYLODIVRLOADCCLK2G4EN_SHIFT                       0                                                 /**< Shift value for RAC_SYLODIVRLOADCCLK2G4EN   */
#define _RAC_SYLOEN_SYLODIVRLOADCCLK2G4EN_MASK                        0x1UL                                             /**< Bit mask for RAC_SYLODIVRLOADCCLK2G4EN      */
#define _RAC_SYLOEN_SYLODIVRLOADCCLK2G4EN_DEFAULT                     0x00000000UL                                      /**< Mode DEFAULT for RAC_SYLOEN                 */
#define _RAC_SYLOEN_SYLODIVRLOADCCLK2G4EN_disable                     0x00000000UL                                      /**< Mode disable for RAC_SYLOEN                 */
#define _RAC_SYLOEN_SYLODIVRLOADCCLK2G4EN_enable                      0x00000001UL                                      /**< Mode enable for RAC_SYLOEN                  */
#define RAC_SYLOEN_SYLODIVRLOADCCLK2G4EN_DEFAULT                      (_RAC_SYLOEN_SYLODIVRLOADCCLK2G4EN_DEFAULT << 0)  /**< Shifted mode DEFAULT for RAC_SYLOEN         */
#define RAC_SYLOEN_SYLODIVRLOADCCLK2G4EN_disable                      (_RAC_SYLOEN_SYLODIVRLOADCCLK2G4EN_disable << 0)  /**< Shifted mode disable for RAC_SYLOEN         */
#define RAC_SYLOEN_SYLODIVRLOADCCLK2G4EN_enable                       (_RAC_SYLOEN_SYLODIVRLOADCCLK2G4EN_enable << 0)   /**< Shifted mode enable for RAC_SYLOEN          */
#define RAC_SYLOEN_SYLODIVRLO2G4EN                                    (0x1UL << 1)                                      /**< SYLODIVRLO2G4EN                             */
#define _RAC_SYLOEN_SYLODIVRLO2G4EN_SHIFT                             1                                                 /**< Shift value for RAC_SYLODIVRLO2G4EN         */
#define _RAC_SYLOEN_SYLODIVRLO2G4EN_MASK                              0x2UL                                             /**< Bit mask for RAC_SYLODIVRLO2G4EN            */
#define _RAC_SYLOEN_SYLODIVRLO2G4EN_DEFAULT                           0x00000000UL                                      /**< Mode DEFAULT for RAC_SYLOEN                 */
#define _RAC_SYLOEN_SYLODIVRLO2G4EN_disable                           0x00000000UL                                      /**< Mode disable for RAC_SYLOEN                 */
#define _RAC_SYLOEN_SYLODIVRLO2G4EN_enable                            0x00000001UL                                      /**< Mode enable for RAC_SYLOEN                  */
#define RAC_SYLOEN_SYLODIVRLO2G4EN_DEFAULT                            (_RAC_SYLOEN_SYLODIVRLO2G4EN_DEFAULT << 1)        /**< Shifted mode DEFAULT for RAC_SYLOEN         */
#define RAC_SYLOEN_SYLODIVRLO2G4EN_disable                            (_RAC_SYLOEN_SYLODIVRLO2G4EN_disable << 1)        /**< Shifted mode disable for RAC_SYLOEN         */
#define RAC_SYLOEN_SYLODIVRLO2G4EN_enable                             (_RAC_SYLOEN_SYLODIVRLO2G4EN_enable << 1)         /**< Shifted mode enable for RAC_SYLOEN          */
#define RAC_SYLOEN_SYLODIVTLO0DBM2G4AUXEN                             (0x1UL << 5)                                      /**< SYLODIVTLO0DBM2G4AUXEN                      */
#define _RAC_SYLOEN_SYLODIVTLO0DBM2G4AUXEN_SHIFT                      5                                                 /**< Shift value for RAC_SYLODIVTLO0DBM2G4AUXEN  */
#define _RAC_SYLOEN_SYLODIVTLO0DBM2G4AUXEN_MASK                       0x20UL                                            /**< Bit mask for RAC_SYLODIVTLO0DBM2G4AUXEN     */
#define _RAC_SYLOEN_SYLODIVTLO0DBM2G4AUXEN_DEFAULT                    0x00000000UL                                      /**< Mode DEFAULT for RAC_SYLOEN                 */
#define _RAC_SYLOEN_SYLODIVTLO0DBM2G4AUXEN_disable                    0x00000000UL                                      /**< Mode disable for RAC_SYLOEN                 */
#define _RAC_SYLOEN_SYLODIVTLO0DBM2G4AUXEN_enable                     0x00000001UL                                      /**< Mode enable for RAC_SYLOEN                  */
#define RAC_SYLOEN_SYLODIVTLO0DBM2G4AUXEN_DEFAULT                     (_RAC_SYLOEN_SYLODIVTLO0DBM2G4AUXEN_DEFAULT << 5) /**< Shifted mode DEFAULT for RAC_SYLOEN         */
#define RAC_SYLOEN_SYLODIVTLO0DBM2G4AUXEN_disable                     (_RAC_SYLOEN_SYLODIVTLO0DBM2G4AUXEN_disable << 5) /**< Shifted mode disable for RAC_SYLOEN         */
#define RAC_SYLOEN_SYLODIVTLO0DBM2G4AUXEN_enable                      (_RAC_SYLOEN_SYLODIVTLO0DBM2G4AUXEN_enable << 5)  /**< Shifted mode enable for RAC_SYLOEN          */
#define RAC_SYLOEN_SYLODIVTLO0DBM2G4EN                                (0x1UL << 6)                                      /**< SYLODIVTLO0DBM2G4EN                         */
#define _RAC_SYLOEN_SYLODIVTLO0DBM2G4EN_SHIFT                         6                                                 /**< Shift value for RAC_SYLODIVTLO0DBM2G4EN     */
#define _RAC_SYLOEN_SYLODIVTLO0DBM2G4EN_MASK                          0x40UL                                            /**< Bit mask for RAC_SYLODIVTLO0DBM2G4EN        */
#define _RAC_SYLOEN_SYLODIVTLO0DBM2G4EN_DEFAULT                       0x00000000UL                                      /**< Mode DEFAULT for RAC_SYLOEN                 */
#define _RAC_SYLOEN_SYLODIVTLO0DBM2G4EN_disable                       0x00000000UL                                      /**< Mode disable for RAC_SYLOEN                 */
#define _RAC_SYLOEN_SYLODIVTLO0DBM2G4EN_enable                        0x00000001UL                                      /**< Mode enable for RAC_SYLOEN                  */
#define RAC_SYLOEN_SYLODIVTLO0DBM2G4EN_DEFAULT                        (_RAC_SYLOEN_SYLODIVTLO0DBM2G4EN_DEFAULT << 6)    /**< Shifted mode DEFAULT for RAC_SYLOEN         */
#define RAC_SYLOEN_SYLODIVTLO0DBM2G4EN_disable                        (_RAC_SYLOEN_SYLODIVTLO0DBM2G4EN_disable << 6)    /**< Shifted mode disable for RAC_SYLOEN         */
#define RAC_SYLOEN_SYLODIVTLO0DBM2G4EN_enable                         (_RAC_SYLOEN_SYLODIVTLO0DBM2G4EN_enable << 6)     /**< Shifted mode enable for RAC_SYLOEN          */
#define RAC_SYLOEN_SYLODIVTLO6DBM2G4AUXEN                             (0x1UL << 9)                                      /**< SYLODIVTLO6DBM2G4AUXEN                      */
#define _RAC_SYLOEN_SYLODIVTLO6DBM2G4AUXEN_SHIFT                      9                                                 /**< Shift value for RAC_SYLODIVTLO6DBM2G4AUXEN  */
#define _RAC_SYLOEN_SYLODIVTLO6DBM2G4AUXEN_MASK                       0x200UL                                           /**< Bit mask for RAC_SYLODIVTLO6DBM2G4AUXEN     */
#define _RAC_SYLOEN_SYLODIVTLO6DBM2G4AUXEN_DEFAULT                    0x00000000UL                                      /**< Mode DEFAULT for RAC_SYLOEN                 */
#define _RAC_SYLOEN_SYLODIVTLO6DBM2G4AUXEN_disable                    0x00000000UL                                      /**< Mode disable for RAC_SYLOEN                 */
#define _RAC_SYLOEN_SYLODIVTLO6DBM2G4AUXEN_enable                     0x00000001UL                                      /**< Mode enable for RAC_SYLOEN                  */
#define RAC_SYLOEN_SYLODIVTLO6DBM2G4AUXEN_DEFAULT                     (_RAC_SYLOEN_SYLODIVTLO6DBM2G4AUXEN_DEFAULT << 9) /**< Shifted mode DEFAULT for RAC_SYLOEN         */
#define RAC_SYLOEN_SYLODIVTLO6DBM2G4AUXEN_disable                     (_RAC_SYLOEN_SYLODIVTLO6DBM2G4AUXEN_disable << 9) /**< Shifted mode disable for RAC_SYLOEN         */
#define RAC_SYLOEN_SYLODIVTLO6DBM2G4AUXEN_enable                      (_RAC_SYLOEN_SYLODIVTLO6DBM2G4AUXEN_enable << 9)  /**< Shifted mode enable for RAC_SYLOEN          */
#define RAC_SYLOEN_SYLODIVTLO6DBM2G4EN                                (0x1UL << 10)                                     /**< SYLODIVTLO6DBM2G4EN                         */
#define _RAC_SYLOEN_SYLODIVTLO6DBM2G4EN_SHIFT                         10                                                /**< Shift value for RAC_SYLODIVTLO6DBM2G4EN     */
#define _RAC_SYLOEN_SYLODIVTLO6DBM2G4EN_MASK                          0x400UL                                           /**< Bit mask for RAC_SYLODIVTLO6DBM2G4EN        */
#define _RAC_SYLOEN_SYLODIVTLO6DBM2G4EN_DEFAULT                       0x00000000UL                                      /**< Mode DEFAULT for RAC_SYLOEN                 */
#define _RAC_SYLOEN_SYLODIVTLO6DBM2G4EN_disable                       0x00000000UL                                      /**< Mode disable for RAC_SYLOEN                 */
#define _RAC_SYLOEN_SYLODIVTLO6DBM2G4EN_enable                        0x00000001UL                                      /**< Mode enable for RAC_SYLOEN                  */
#define RAC_SYLOEN_SYLODIVTLO6DBM2G4EN_DEFAULT                        (_RAC_SYLOEN_SYLODIVTLO6DBM2G4EN_DEFAULT << 10)   /**< Shifted mode DEFAULT for RAC_SYLOEN         */
#define RAC_SYLOEN_SYLODIVTLO6DBM2G4EN_disable                        (_RAC_SYLOEN_SYLODIVTLO6DBM2G4EN_disable << 10)   /**< Shifted mode disable for RAC_SYLOEN         */
#define RAC_SYLOEN_SYLODIVTLO6DBM2G4EN_enable                         (_RAC_SYLOEN_SYLODIVTLO6DBM2G4EN_enable << 10)    /**< Shifted mode enable for RAC_SYLOEN          */
#define RAC_SYLOEN_SYLODIVSGTESTDIVEN                                 (0x1UL << 31)                                     /**< SYLODIVSGTESTDIVEN                          */
#define _RAC_SYLOEN_SYLODIVSGTESTDIVEN_SHIFT                          31                                                /**< Shift value for RAC_SYLODIVSGTESTDIVEN      */
#define _RAC_SYLOEN_SYLODIVSGTESTDIVEN_MASK                           0x80000000UL                                      /**< Bit mask for RAC_SYLODIVSGTESTDIVEN         */
#define _RAC_SYLOEN_SYLODIVSGTESTDIVEN_DEFAULT                        0x00000000UL                                      /**< Mode DEFAULT for RAC_SYLOEN                 */
#define _RAC_SYLOEN_SYLODIVSGTESTDIVEN_disable                        0x00000000UL                                      /**< Mode disable for RAC_SYLOEN                 */
#define _RAC_SYLOEN_SYLODIVSGTESTDIVEN_enable                         0x00000001UL                                      /**< Mode enable for RAC_SYLOEN                  */
#define RAC_SYLOEN_SYLODIVSGTESTDIVEN_DEFAULT                         (_RAC_SYLOEN_SYLODIVSGTESTDIVEN_DEFAULT << 31)    /**< Shifted mode DEFAULT for RAC_SYLOEN         */
#define RAC_SYLOEN_SYLODIVSGTESTDIVEN_disable                         (_RAC_SYLOEN_SYLODIVSGTESTDIVEN_disable << 31)    /**< Shifted mode disable for RAC_SYLOEN         */
#define RAC_SYLOEN_SYLODIVSGTESTDIVEN_enable                          (_RAC_SYLOEN_SYLODIVSGTESTDIVEN_enable << 31)     /**< Shifted mode enable for RAC_SYLOEN          */

